// Пользователь вводит число, характеризующее количество элементов будущего массива Необходимо составить ряд Фибоначчи, где каждое число образуется при сложении 2 предыдущих

// 10 -> 0, 1, 1, 2, 3, 5, 8, 13, 21, 34


//вариант 1
// const a = +prompt();
// let arr = '0, 1';
// let prev = 0;
// let now = 1;

// for (let i = 3; i <= a; i++) {
//   let sum = prev + now;
//   prev = now;
//   now = sum;
//   arr += `, ${sum}`;
// }

// console.log(arr);

//вариант 2

const a = +prompt();
let arr = '0, 1';
let prev = 0;
let now = 1;

for (let i = 3; i <= a; i++) {
  
}

